In [1]:
import pandas as pd
import numpy as np

In [2]:
bf = pd.read_csv("black_friday.csv")

In [ ]:
bf.head(2)

In [ ]:
bf.tail()

In [ ]:
bf.shape

In [ ]:
bf.info()

In [ ]:
aux = bf[["Gender", "Age"]]
aux.head(5)

In [ ]:
aux2 = aux[aux["Gender"] == "F"]

In [ ]:
aux2.head()

In [ ]:
aux3 = aux2[aux2["Age"] == "26-35"]
aux3.head()

In [ ]:
aux3.describe()

In [ ]:
aux3.groupby("Gender")["Age"].value_counts()

In [ ]:
aux4 = aux3["Age"]
aux4.head()

In [ ]:
 resposta= aux4.value_counts()

In [ ]:
print(resposta)

In [ ]:
aux4.head(3)

In [ ]:
aux4.count()

In [ ]:
aux = bf[["Gender", "Age"]]
aux.head(5)

In [ ]:
q2 = aux[(aux["Gender"] == "F") & (aux["Age"] == "26-35")]

In [ ]:
q2.head()

In [ ]:
resposta = q2["Gender"]

In [ ]:
print(resposta.count())

In [ ]:
q2["Gender"].count()

In [ ]:
?count

In [ ]:
?.count()

In [ ]:
df_ids = bf["User_ID"]
df_ids.head()

In [ ]:
unique_aux = bf.drop_duplicates(subset = "User_ID")
unique_aux.head(3)

In [ ]:
q3_answer = unique_aux["User_ID"].count()
q3_answer

In [ ]:
bf.info()

In [ ]:
bf.dtypes

In [ ]:
bf.dtypes.nunique()

In [ ]:
bf.isnull().sum()

In [ ]:
bf.isnull().sum().nunique()

In [ ]:
df = bf

In [ ]:
df.isnull().sum()

In [ ]:
df_notNA = df.dropna(axis = 0)
df_notNA.isnull().sum()

In [ ]:
lt = df.shape[0] # numero de linhas totais com as nulas
lt               # inclusas

In [ ]:
l_notna = df_notNA.shape[0] #linhas sem as linhas NaN
l_notna

In [ ]:
# Linhas NaN
q5 = (lt - l_notna)/lt
q5

In [ ]:
help(len)

In [ ]:
df.head()

In [ ]:
df.isnull().sum()

In [ ]:
df.isnull().sum().max()

In [ ]:
df["Product_Category_3"].dropna().mode()

In [ ]:
mode?

In [ ]:
purchase = df["Purchase"]
purchase.describe().T

In [ ]:
def norm(column):
    return ((column - column.min()) / 
            (column.max() - column.min()))

print(df["Purchase"].agg(norm).mean())

In [ ]:
norm_purchase = df["Purchase"].agg(norm)

In [ ]:
norm_purchase.head()

In [ ]:
print(norm_purchase.head(5))

In [3]:
df = bf

In [16]:
#padronizar

def standard(column):
        return ((column - column.mean())/
                column.std())
    
df["Purchase_std"] = df["Purchase"].agg(standard)
s9 = df.loc[(df["Purchase_std"] >= -1) & 
            (df["Purchase_std"] <=  1),:].shape[0]
s9

348631

In [5]:
df_9.describe().T

count    5.375770e+05
mean    -1.632626e-16
std      1.000000e+00
min     -1.836743e+00
25%     -6.962145e-01
50%     -2.553411e-01
75%      5.499153e-01
max      2.936574e+00
Name: Purchase, dtype: float64

In [6]:
aux= 2.936574e+00
df_9[df_9 == aux].count()

0

In [ ]:
print(df_9)

In [7]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [10]:
df10 = df[["Product_Category_2", "Product_Category_3"]]
df10.head()

   Product_Category_2  Product_Category_3
0                 NaN                 NaN
1                 6.0                14.0
2                 NaN                 NaN
3                14.0                 NaN
4                 NaN                 NaN

In [17]:
df10.isna().head()

   Product_Category_2  Product_Category_3
0                True                True
1               False               False
2                True                True
3               False                True
4                True                True

In [19]:
df_booleano = df[["Product_Category_2", "Product_Category_3"]].isna()
    
dfp2 = df_booleano.loc[df_booleano["Product_Category_2"] == True, :]
dfp2.head()

    Product_Category_2  Product_Category_3
0                 True                True
2                 True                True
4                 True                True
9                 True                True
11                True                True

In [21]:
answer10 = dfp2["Product_Category_2"].equals(dfp2["Product_Category_3"])

In [22]:
answer10

True